app/controllers/players_controller.rb

INSERT INTO "players" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('', '4287913b4372589db7b656d0550aa5fc732b6a39', '2010-01-03 14:39:45', '0ef15f68d5860e391609f3600153313287647e7f', NULL, NULL, 'kota', 'fujiwara.kota@gmail.com', '2010-01-03 14:39:45')
---
  def create
    logout_keeping_session!
    params[:player][:name] = params[:player][:login]
    @player = Player.new(params[:player])
    @player.country = Country.find_by_id(params[:player][:country_id])
    success = @player && @player.save